<a href="https://colab.research.google.com/github/TruongScotl/LearnPython_for_data_analysis/blob/main/Learn_data_clearning_and_preparation_ipynbp.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Handling Missing Data

In [ ]:
import pandas as pd 
import numpy as np
from numpy import nan as NA

In [ ]:
string_data = pd.Series(['Truong','Son',np.nan,'Tien'])
string_data

0    Truong
1       Son
2       NaN
3      Tien
dtype: object

In [ ]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [ ]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [ ]:
data = pd.Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
data= pd.DataFrame([[1.,2.,4.],[2.,NA,NA],[NA,NA,NA],[NA,6.7,4.]])
cleaned = data.dropna()
data
cleaned
#drop rows that are all NA:
cleaned = data.dropna(how='all')
cleaned

     0    1    2
0  1.0  2.0  4.0
1  2.0  NaN  NaN
3  NaN  6.7  4.0

In [ ]:
data[4]= NA
data
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  2.0  4.0
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.7  4.0

In [ ]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1]= NA
df.iloc[:2,2]= NA
df
df.dropna()
df.dropna(thresh=2)

          0         1         2
2  0.526774       NaN  0.772900
3 -1.129077       NaN -0.267980
4 -1.451863  0.425076 -0.211360
5  0.482514  0.755266 -0.501541
6 -2.106395  1.226975 -0.225181

Filling In Missing Data

In [ ]:
df.fillna(0)
#fillna with a dict, you can use different fill value for each column
df.fillna({1:0.5,2:0})

          0         1         2
0  1.086350  0.500000  0.000000
1 -0.559348  0.500000  0.000000
2  0.526774  0.500000  0.772900
3 -1.129077  0.500000 -0.267980
4 -1.451863  0.425076 -0.211360
5  0.482514  0.755266 -0.501541
6 -2.106395  1.226975 -0.225181

In [ ]:
#fillna return a new object, but you can modify the existing object in-place
_= df.fillna(0,inplace=True)
df

          0         1         2
0  1.086350  0.000000  0.000000
1 -0.559348  0.000000  0.000000
2  0.526774  0.000000  0.772900
3 -1.129077  0.000000 -0.267980
4 -1.451863  0.425076 -0.211360
5  0.482514  0.755266 -0.501541
6 -2.106395  1.226975 -0.225181

In [ ]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:, 1]=NA
df.iloc[4:, 2]=NA
df
df.fillna(method='ffill')
df.fillna(method='ffill',limit=2)

          0         1         2
0 -1.712700  0.647439  1.604645
1 -0.831630  0.387523  0.184936
2 -0.776162  0.387523  0.159716
3 -0.136794  0.387523  0.383151
4  0.194355       NaN  0.383151
5 -1.826336       NaN  0.383151

In [ ]:
data = pd.Series([1.,NA,3.5,NA,7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

DATA Transformation